In [ ]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.ensemble import RandomForestClassifier



from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report
from sklearn.metrics import accuracy_score

from sklearn.ensemble import BaggingClassifier
from sklearn import tree

In [ ]:
df = pd.read_csv('dataset1.csv')

In [ ]:
df.dropna(subset=['Language Main'], inplace=True)

In [ ]:
filter_cols = ['First Name', 'Surname']

In [5]:
df1 = df.dropna(how='all').dropna(how='all', axis=1)

In [6]:
df1.head()

   Sno First Name Middle Name  Surname Language Main
0  1.0    Hiranya         NaN  Durrani      Kashmiri
1  2.0  Bhupendra         NaN   Tikkoo      Kashmiri
2  3.0  Mrigavati         NaN  Durrani      Kashmiri
3  4.0     Smriti         NaN    Raina      Kashmiri
4  5.0    Heeposh         NaN   Talwar      Kashmiri

In [7]:
df2 = df1.drop(['Middle Name','Sno'],axis = 1)

In [8]:
df2.dtypes

First Name       object
Surname          object
Language Main    object
dtype: object

In [9]:
df2.head()

  First Name  Surname Language Main
0    Hiranya  Durrani      Kashmiri
1  Bhupendra   Tikkoo      Kashmiri
2  Mrigavati  Durrani      Kashmiri
3     Smriti    Raina      Kashmiri
4    Heeposh   Talwar      Kashmiri

In [10]:
print(df2['First Name'].unique())
print(df2['Surname'].unique())

['Hiranya' 'Bhupendra' 'Mrigavati' ... 'Gargi' 'Prathmesh' 'Prathit']
['Durrani' 'Tikkoo' 'Raina' 'Talwar' 'Padar' 'Machama' 'Akhoon' 'Kanna'
 'Parimoo' 'Mirza' 'Dar' 'Munshi' 'Draboo' 'Chakoo' 'Bhat' 'Sangra' 'Khar'
 'Wani' 'Bharali' 'Neog' 'Sahu' 'Mahato' 'Thakur' 'Barua' 'Talukdar'
 'Bora' 'Gogoi' 'Borthakur' 'Goswami' 'Sharma' 'Chutiapeople' 'Hazarika'
 'Sutradhar' 'Sarma' 'Pathak' 'Deka' 'Rajni' 'Saikia' 'Phukan' 'Barah'
 'Borah' 'Ghosh' 'Baruah' 'Chakraborty' 'Bordoloi' 'Kumar' 'Choudhary'
 'Tiwari' 'Verma' 'Kashyap' 'Jaiswal' 'Shukla' 'Bharadwaj' 'Mishra'
 'Singh' 'Yadav' 'Rai' 'Jha' 'Sinha' 'Thandan' 'Vaidyar' 'Ezhuthachan'
 'Channar' 'Chekavar' 'Kaimal' 'Pillai' 'Menon' 'Kongassery' 'Nambiar'
 'Panikkar' 'Krishnan' 'Sebastian' 'Nair' 'Varghese' 'Kartha' 'Moopan'
 'Panicker' 'Konranchath' 'Thirumulpad' 'Vijayan' 'Achari' 'Chowdhury'
 'Dalal' 'Gajjar' 'Wadia' 'Doshi' 'Shah' 'Joshi' 'Dastur' 'Mistry'
 'Daruwala' 'Desai' 'Ganjawala' 'Cursetji' 'Kapadiya' 'Barot' 'Thakkar'
 'Mukesh' 'Cowasjee' 'Dholakia' 'Sheth' 'Patel' 'Modi' 'Choksi' 'Lakhani'
 'Nanji' 'Purohit' 'Parekh' 'Gupta' 'Adani' 'Acharya' 'VikramSarabhai'
 'Ambani' 'Bose' 'Basu' 'Moitra' 'Bandhyopadhyay' 'Chattopadhyay'
 'Chatterjee' 'Banerjee' 'Ganguly' 'Bhattacharya' 'Biswas' 'Dutta'
 'SenBasu' 'Tagore' 'Mukherjee' 'Baliga' 'Barreto' 'Afonso' 'DeSouza'
 'Alves' 'Pilgaonkar' 'Gonsalves' 'Asgaonkar' 'Andrade' 'Akerkar'
 'Almeida' 'Menezes' 'Mudakatte' 'Salwankar' 'Shankar' 'Gauda' 'Ballari'
 'Gowda' 'Aravind' 'Pojaary' 'Kumbar' 'Shetty' 'Rajani' 'Rajal' 'Bhatt'
 'Deo' 'Raju' 'Pattanasetti' 'Jayanthi' 'Sunagar' 'Kashyapa' 'Kulkarni'
 'Mulimani' 'Udupa' 'Bhatta' 'Kamat' 'Devadiga' 'Hegade' 'Abujam'
 'Akoijam' 'Chiru' 'Ahanthem' 'Sanasam' 'Angom' 'Singson' 'Shaikhom'
 'Sagolsem' 'Sumpi' 'Chakhesang' 'Akham' 'Salam' 'Dodeja' 'Makhija'
 'Juneja' 'Hinduja' 'Mirchandani' 'Asrani' 'Lohana' 'Bhatia' 'Sandhu'
 'Ahuja' 'Khan' 'Bhil' 'Kukreja' 'Lanjwani' 'Raheja' 'Kolhi' 'Bhati'
 'Khatri' 'Chachar' 'Bhagwani' 'Malik' 'Kaur' 'Dhaliwal' 'Bajaj' 'Sood'
 'Dhillon' 'Kalra' 'Duggal' 'Virk' 'Kohli' 'Anand' 'Khanna' 'Malhotra'
 'Aneja' 'Dosanjh' 'Bhasin' 'Sodhi' 'Dhawan' 'Arora' 'Batra' 'Chawla'
 'Mehta' 'Khurana' 'Mehra' 'Bajwa' 'Deol' 'Kapoor' 'Mahajan' 'Sehgal'
 'Lal' 'Vikram' 'Parajuli' 'Gurung' 'Subba' 'Dhungana' 'Kami' 'Damai'
 'Limboo' 'Lepcha' 'Karki' 'Maharjan' 'Khatun' 'Thapa' 'Sarki' 'Chettri'
 'Bhutia' 'Tamang' 'Sherpa' 'Thevar' 'Mudaliar' 'Udayar' 'Srinivasan'
 'Venkatraman' 'Iyengar' 'Subramaniam' 'Chettiar' 'Naicker' 'Iyer'
 'Krishnamurthi' 'Idaiyar' 'Paraiyar' 'Gounder' 'Panda' 'Bisoi' 'Pujari'
 'Biswal' 'Pradhan' 'Pattnaik' 'Panigrahi' 'Praharaj' 'Behera' 'Mahapatra'
 'Sabat' 'Sarangi' 'Patra' 'Das' 'Dikshit' 'Babu' 'Reddy' 'Bhagavatula'
 'Goud' 'Abdul' 'Chiguluri' 'Gurram' 'Gunti' 'Balaji' 'Bethi'
 'Bellamkonda' 'Davuluri' 'Akkineni' 'Shirke' 'Pawar' 'Bhandari' 'Kharche'
 'Apte' 'Bhede' 'Kamble' 'Ahale' 'Athawale' 'Gaitonde' 'Patil' 'Adhikari'
 'Deshmukh' 'Kapse' 'Deshpande' 'Gawali' 'Gadkari']

In [11]:
df2['First Name'].value_counts()
df2['Surname'].value_counts()

Ghosh          643
Chakraborty    643
Udayar         624
Shankar        592
Shetty         592
              ...
Nanji          100
Choksi         100
Modi           100
Sheth          100
Gupta          100
Name: Surname, Length: 305, dtype: int64

In [12]:
data = pd.get_dummies(df2, columns = ['First Name', 'Surname'])
print(data)

      Language Main  First Name_10K+  First Name_Aaarti  First Name_Aabha  \
0          Kashmiri                0                  0                 0
1          Kashmiri                0                  0                 0
2          Kashmiri                0                  0                 0
3          Kashmiri                0                  0                 0
4          Kashmiri                0                  0                 0
...             ...              ...                ...               ...
81663       Marathi                0                  0                 0
81664       Marathi                0                  0                 0
81665       Marathi                0                  0                 0
81666       Marathi                0                  0                 0
81667       Marathi                0                  0                 0

       First Name_Aabharan  First Name_Aabharana  First Name_Aabhas  \
0                        0                     0                  0
1                        0                     0                  0
2                        0                     0                  0
3                        0                     0                  0
4                        0                     0                  0
...                    ...                   ...                ...
81663                    0                     0                  0
81664                    0                     0                  0
81665                    0                     0                  0
81666                    0                     0                  0
81667                    0                     0                  0

       First Name_Aabhat  First Name_Aabheer  First Name_Aabheri  ...  \
0                      0                   0                   0  ...
1                      0                   0                   0  ...
2                      0                   0                   0  ...
3                      0                   0                   0  ...
4                      0                   0                   0  ...
...                  ...                 ...                 ...  ...
81663                  0                   0                   0  ...
81664                  0                   0                   0  ...
81665                  0                   0                   0  ...
81666                  0                   0                   0  ...
81667                  0                   0                   0  ...

       Surname_Varghese  Surname_Venkatraman  Surname_Verma  Surname_Vijayan  \
0                     0                    0              0                0
1                     0                    0              0                0
2                     0                    0              0                0
3                     0                    0              0                0
4                     0                    0              0                0
...                 ...                  ...            ...              ...
81663                 0                    0              0                0
81664                 0                    0              0                0
81665                 0                    0              0                0
81666                 0                    0              0                0
81667                 0                    0              0                0

       Surname_Vikram  Surname_VikramSarabhai  Surname_Virk  Surname_Wadia  \
0                   0                       0             0              0
1                   0                       0             0              0
2                   0                       0             0              0
3                   0                       0             0              0
4                   0                       0             0              0
...               ...                     ...           ...            ...
81663               0                       0             0              0
81664               0                       0             0              0
81665               0                       0             0              0
81666               0                       0             0              0
81667               0                       0             0              0

       Surname_Wani  Surname_Yadav
0                 0              0
1                 0              0
2                 0              0
3                 0              0
4                 0              0
...             ...            ...
81663             0              0
81664             0              0
81665             0              0
81666             0              0
81667             0              0

[81667 rows x 4054 columns]

In [13]:
data.head()

,Language Main,First Name_10K+,First Name_Aaarti,First Name_Aabha,First Name_Aabharan,First Name_Aabharana,First Name_Aabhas,First Name_Aabhat,First Name_Aabheer,First Name_Aabheri,...,Surname_Varghese,Surname_Venkatraman,Surname_Verma,Surname_Vijayan,Surname_Vikram,Surname_VikramSarabhai,Surname_Virk,Surname_Wadia,Surname_Wani,Surname_Yadav
0,Kashmiri,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,Kashmiri,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,Kashmiri,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,Kashmiri,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,Kashmiri,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [14]:
#  def label_encoder(y):
#     le = LabelEncoder()
#     df2[y] = le.fit_transform(df2[y])
 
# label_list = ["First Name", "Surname"]

# for l in label_list:
#     label_encoder(l)
 
# #Display transformed data
# df2.head()

In [15]:
x=data.drop('Language Main',axis=1)
y=data['Language Main']
x=pd.get_dummies(x)

In [16]:

x_train,x_temp,y_train,y_temp=train_test_split(x,y,train_size=.8,random_state=1)
x_test,x_valid,y_test,y_valid=train_test_split(x_temp,y_temp,train_size=0.4)

In [17]:
# X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

# # Split the train data into train and validation sets
# X_train, X_val, y_train, y_val = train_test_split(X_train, y_train, test_size=0.2, random_state=0)

In [18]:
x_train.shape

(65333, 4053)

In [19]:
y_train.shape

(65333,)

In [20]:
y_train

9207     Maithili
81600     Marathi
11505    Maithili
27385     Bengali
59771      Nepali
           ...
21440    Gujarati
73350      Telugu
50058     Punjabi
5192     Kashmiri
77709     Marathi
Name: Language Main, Length: 65333, dtype: object

In [21]:
x_valid.shape

(9801, 4053)

In [22]:
x_test.shape

(6533, 4053)

In [23]:
y_train = y_train.values.reshape(-1,1)

In [24]:
y_test = y_test.values.reshape(-1,1)

In [25]:
y_train.shape

(65333, 1)

In [26]:
y_test.shape

(6533, 1)

In [27]:
y_test

array([['Manipuri'],
       ['Tamil'],
       ['Sindhi'],
       ...,
       ['Manipuri'],
       ['Punjabi'],
       ['Kannada']], dtype=object)

In [28]:

# model = BaggingClassifier(tree.DecisionTreeClassifier(random_state=1))
# model.fit(x_train, y_train)
# model.score(x_test,y_test)

In [28]:

model0 = BaggingClassifier(tree.DecisionTreeClassifier(random_state=1))
model0.fit(x_train, y_train)
model0.score(x_valid,y_valid)

C:\Users\AjithKomuravelly\anaconda3\lib\site-packages\sklearn\ensemble\_bagging.py:804: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

0.9577568262519898

In [29]:

model = BaggingClassifier(RandomForestClassifier(random_state = 42))
model.fit(x_train, y_train)
model.score(x_valid,y_valid)

C:\Users\AjithKomuravelly\anaconda3\lib\site-packages\sklearn\ensemble\_bagging.py:804: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

0.9567391082542598

In [30]:
y_pred=model.predict(x_test)

In [31]:
Y_pred2 = model.predict(x_train)

In [33]:


print("TRAIN accuracy:",np.round(accuracy_score(y_train,model.predict(x_train)),2))
print("TEST accuracy:",np.round(accuracy_score(y_test,y_pred),2))
print( classification_report(y_test,y_pred))

TRAIN accuracy: 0.99
TEST accuracy: 0.96
              precision    recall  f1-score   support

    Assamese       0.96      0.83      0.89       265
     Bengali       0.96      1.00      0.98       474
    Gujarati       1.00      0.86      0.93       295
     Kannada       0.90      0.84      0.87       428
    Kashmiri       1.00      1.00      1.00       424
    Konakani       1.00      1.00      1.00       397
    Maithili       0.87      1.00      0.93       505
   Malayalam       1.00      1.00      1.00       466
    Manipuri       1.00      1.00      1.00       439
     Marathi       1.00      0.90      0.95       332
      Nepali       0.98      1.00      0.99       439
       Oriya       1.00      1.00      1.00       336
     Punjabi       0.93      0.98      0.95       592
      Sindhi       0.95      0.85      0.90       294
       Tamil       1.00      1.00      1.00       401
      Telugu       0.91      1.00      0.95       446

    accuracy                           0.96      6533
   macro avg       0.97      0.95      0.96      6533
weighted avg       0.96      0.96      0.96      6533

In [34]:
Y_pred2

array(['Maithili', 'Marathi', 'Maithili', ..., 'Punjabi', 'Kashmiri',
       'Marathi'], dtype=object)

In [35]:
y_pred

array(['Manipuri', 'Tamil', 'Sindhi', ..., 'Manipuri', 'Punjabi',
       'Kannada'], dtype=object)

In [36]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_test,y_pred))

0.9614266033981326

In [37]:
y_val=model.predict(x_valid)

In [38]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_valid,y_val))

0.9567391082542598

In [39]:
df_test=pd.DataFrame(y_test)

In [41]:
df_test

             0
0     Manipuri
1        Tamil
2       Sindhi
3     Gujarati
4     Assamese
...        ...
6528  Maithili
6529   Punjabi
6530  Manipuri
6531   Punjabi
6532   Kannada

[6533 rows x 1 columns]

In [42]:
df_test.columns=['y_test']
df_test

        y_test
0     Manipuri
1        Tamil
2       Sindhi
3     Gujarati
4     Assamese
...        ...
6528  Maithili
6529   Punjabi
6530  Manipuri
6531   Punjabi
6532   Kannada

[6533 rows x 1 columns]

In [43]:
df_pred =pd.DataFrame(y_pred)

In [44]:
df_pred

             0
0     Manipuri
1        Tamil
2       Sindhi
3     Gujarati
4     Assamese
...        ...
6528  Maithili
6529   Punjabi
6530  Manipuri
6531   Punjabi
6532   Kannada

[6533 rows x 1 columns]

In [45]:
df_pred.columns=['y_pred']
df_pred

        y_pred
0     Manipuri
1        Tamil
2       Sindhi
3     Gujarati
4     Assamese
...        ...
6528  Maithili
6529   Punjabi
6530  Manipuri
6531   Punjabi
6532   Kannada

[6533 rows x 1 columns]

In [46]:
z=pd.concat([df_pred.reset_index(drop=True),df_test.reset_index(drop=True)],axis=1)

In [47]:
z

        y_pred    y_test
0     Manipuri  Manipuri
1        Tamil     Tamil
2       Sindhi    Sindhi
3     Gujarati  Gujarati
4     Assamese  Assamese
...        ...       ...
6528  Maithili  Maithili
6529   Punjabi   Punjabi
6530  Manipuri  Manipuri
6531   Punjabi   Punjabi
6532   Kannada   Kannada

[6533 rows x 2 columns]

In [48]:
z['equal']=(z['y_test']==z['y_pred'])

In [49]:
z

        y_pred    y_test  equal
0     Manipuri  Manipuri   True
1        Tamil     Tamil   True
2       Sindhi    Sindhi   True
3     Gujarati  Gujarati   True
4     Assamese  Assamese   True
...        ...       ...    ...
6528  Maithili  Maithili   True
6529   Punjabi   Punjabi   True
6530  Manipuri  Manipuri   True
6531   Punjabi   Punjabi   True
6532   Kannada   Kannada   True

[6533 rows x 3 columns]

In [50]:
count=0
for i in z['equal']:
    if (i==False):
        count+=1
print(count)

252

In [51]:
# 252 - false
# 6281 - True

In [52]:
# FOR VALIDATION sET

In [53]:
ae=pd.DataFrame(y_val)

In [54]:
ae

             0
0      Marathi
1       Nepali
2       Telugu
3     Manipuri
4       Nepali
...        ...
9796     Tamil
9797     Oriya
9798     Oriya
9799   Bengali
9800  Manipuri

[9801 rows x 1 columns]

In [55]:
ae.columns=['y_val']

In [56]:
ae

         y_val
0      Marathi
1       Nepali
2       Telugu
3     Manipuri
4       Nepali
...        ...
9796     Tamil
9797     Oriya
9798     Oriya
9799   Bengali
9800  Manipuri

[9801 rows x 1 columns]

In [57]:
be=pd.DataFrame(y_valid)

In [58]:
be

      Language Main
79385       Marathi
62459        Nepali
75541        Telugu
44798      Manipuri
57499        Nepali
...             ...
63118         Tamil
68728         Oriya
68881         Oriya
26942       Bengali
45537      Manipuri

[9801 rows x 1 columns]

In [59]:
be.columns=['y_valid']

In [60]:
be

        y_valid
79385   Marathi
62459    Nepali
75541    Telugu
44798  Manipuri
57499    Nepali
...         ...
63118     Tamil
68728     Oriya
68881     Oriya
26942   Bengali
45537  Manipuri

[9801 rows x 1 columns]

In [61]:
y=pd.concat([ae.reset_index(drop=True),be.reset_index(drop=True)],axis=1)

In [62]:
y

         y_val   y_valid
0      Marathi   Marathi
1       Nepali    Nepali
2       Telugu    Telugu
3     Manipuri  Manipuri
4       Nepali    Nepali
...        ...       ...
9796     Tamil     Tamil
9797     Oriya     Oriya
9798     Oriya     Oriya
9799   Bengali   Bengali
9800  Manipuri  Manipuri

[9801 rows x 2 columns]

In [66]:
y.head(1000)

        y_val   y_valid  is_equal
0     Marathi   Marathi      True
1      Nepali    Nepali      True
2      Telugu    Telugu      True
3    Manipuri  Manipuri      True
4      Nepali    Nepali      True
..        ...       ...       ...
995   Bengali   Bengali      True
996  Konakani  Konakani      True
997   Marathi   Marathi      True
998  Maithili   Punjabi     False
999   Kannada   Kannada      True

[1000 rows x 3 columns]

In [63]:
y['is_equal']=(y['y_val'] == y['y_valid'])

In [64]:
y

         y_val   y_valid  is_equal
0      Marathi   Marathi      True
1       Nepali    Nepali      True
2       Telugu    Telugu      True
3     Manipuri  Manipuri      True
4       Nepali    Nepali      True
...        ...       ...       ...
9796     Tamil     Tamil      True
9797     Oriya     Oriya      True
9798     Oriya     Oriya      True
9799   Bengali   Bengali      True
9800  Manipuri  Manipuri      True

[9801 rows x 3 columns]

In [65]:
y['is_equal'].value_counts()

True     9377
False     424
Name: is_equal, dtype: int64

In [68]:
import joblib

In [71]:
#Serialize the model and save
# from sklearn.externals import joblib
joblib.dump(model, 'randomfs.pkl')
print("Random Forest Model Saved")
#Load the model
model = joblib.load('randomfs.pkl')
# Save features from training
rnd_columns = list(x_train.columns)
joblib.dump(rnd_columns, 'rnd_columns.pkl')
print("Random Forest Model Colums Saved")

Random Forest Model Saved
Random Forest Model Colums Saved

In [72]:
pip install Flask

Requirement already satisfied: Flask in c:\users\ajithkomuravelly\anaconda3\lib\site-packages (1.1.2)
Requirement already satisfied: Werkzeug>=0.15 in c:\users\ajithkomuravelly\anaconda3\lib\site-packages (from Flask) (2.0.3)
Requirement already satisfied: Jinja2>=2.10.1 in c:\users\ajithkomuravelly\anaconda3\lib\site-packages (from Flask) (2.11.3)
Requirement already satisfied: itsdangerous>=0.24 in c:\users\ajithkomuravelly\anaconda3\lib\site-packages (from Flask) (2.0.1)
Requirement already satisfied: click>=5.1 in c:\users\ajithkomuravelly\anaconda3\lib\site-packages (from Flask) (8.1.3)
Requirement already satisfied: colorama in c:\users\ajithkomuravelly\anaconda3\lib\site-packages (from click>=5.1->Flask) (0.4.5)
Requirement already satisfied: MarkupSafe>=0.23 in c:\users\ajithkomuravelly\anaconda3\lib\site-packages (from Jinja2>=2.10.1->Flask) (2.0.1)
Note: you may need to restart the kernel to use updated packages.